import numpy.random as rnd

first_names = [
    "'Мирон'",
    "'Давид'",
    "'Станислав'",
    "'Артём'",
    "'Дарья'",
    "'Вадим'",
    "'Арсений'",
    "'Борис'",
    "'Денис'",
    "'Константин'",
    "'Дарья'",
    "'Михаил'",
    "'Егор'",
    "'София'"
]

second_names = [
    "'Дубровин'",
    "'Кожевников'",
    "'Овсянников'",
    "'Егоров'",
    "'Рубцова'",
    "'Агапов'",
    "'Киреев'",
    "'Васильев'",
    "'Колесников'",
    "'Безруков'",
    "'Федорова'",
    "'Захаров'",
    "'Зубков'",
    "'Бурова'"
]

patronymics = [
    "'Маркович'",
    "'Владимирович'",
    "'Владимирович'",
    "'Максимович'",
    "'Егоровна'",
    "'Николаевич'",
    "'Игоревич'",
    "'Макарович'",
    "'Иванович'",
    "'Даниилович'",
    "'Михайловна'",
    "'Денисович'",
    "'Артёмович'",
    "'Романовна'"
]

sexes = ['FALSE'] * 14
sexes[4] = sexes[10] = sexes[13] = 'TRUE'

posts = [
    "'Преподаватель'",
    "'Профессор'",
    "'Старший преподаватель'"
]

f = open(file='Professors values.txt', mode="w")

for i in range(0, 14):

    age = rnd.randint(25, 65)

    f.write(
        '( '
        + 'DEFAULT, '
        + f'{first_names[i]}, '
        + f'{second_names[i]}, '
        + f'{patronymics[i]}, '
        + f'{age}, '
        + f'{sexes[i]}, '
        + f'{rnd.choice(posts)}, '
        + f'{rnd.randint(0, age / 3)} '
        + '),\n')


# Дубровин	    Мирон	    Маркович
# Кожевников	Давид	    Владимирович
# Овсянников	Станислав	Владимирович
# Егоров	    Артём	    Максимович
# Рубцова	    Дарья	    Егоровна
# Агапов	    Вадим	    Николаевич
# Киреев	    Арсений	    Игоревич
# Васильев	    Борис	    Макарович
# Колесников	Денис	    Иванович
# Безруков	    Константин	Даниилович
# Федорова	    Дарья	    Михайловна
# Захаров	    Михаил	    Денисович
# Зубков	    Егор	    Артёмович
# Бурова	    София	    Романовна
